#include <stdio.h>

int main(void)
{
    int N;
    int K;

    scanf("%d", &N);
    scanf("%d", &K);
    //0~N 범위의 수를 K개 더하여 N 을 만들수있는 경우의 수

    0 ~ 1   -> 1
    K
    1   1
    2   1 0 
        0 1
    3   1 0 0
        0 1 0
        0 0 1

    0 ~ 2
    1   2
    2   2 0
        0 2
        1 1
    3   2 0 0
        0 2 0
        0 0 2
        1 1 0
        0 1 1

    0 ~ 3
    1   3
    2   3 0
        0 3
        1 2
        2 1
    3   3 0 0
        0 3 0
        0 0 3
        1 2 0
        0 1 2
        2 1 0
        0 2 1
        1 1 1
    
    return 0;
}